import unittest
from functools import cmp_to_key

from ..img_ocr import *


class TestMathFunc(unittest.TestCase):

    def test_ocrPointCompare(self):
        obj1 = [[[121.0, 35.0], [305.0, 35.0], [305.0, 82.0], [121.0, 82.0]], ('阴经(脏)', 0.8616531491279602)]
        obj2 = [[[458.0, 35.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('阳经()', 0.8003172874450684)]
        self.assertEqual(-1, ocrPointCompare(obj1, obj2))

    def test_get_result_line_content(self):
        line = [[[121.0, 35.0], [305.0, 35.0], [305.0, 82.0], [121.0, 82.0]], ('阴经(脏)', 0.8616531491279602)];
        self.assertEqual(getResultLineContent(line), '阴经(脏)')

    def test_joinResultString(self):
        result = [
            [[[121.0, 35.0], [305.0, 35.0], [305.0, 82.0], [121.0, 82.0]], ('上', 0.8616531491279602)],
            [[[458.0, 35.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('下', 0.8003172874450684)],
        ]
        self.assertEqual("上,下", joinResultString(result, ","))
        self.assertEqual("上下", joinResultString(result))

    def test_ocr_result_sort(self):
        result = [
            [[[121.0, 35.0], [305.0, 35.0], [305.0, 82.0], [121.0, 82.0]], ('上', 0.8616531491279602)],
            [[[458.0, 35.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('下', 0.8003172874450684)],
        ]
        sortOcrResult(result)
        self.assertEqual("上下", joinResultString(result))

        result = [
            [[[121.0, 35.0], [305.0, 35.0], [305.0, 82.0], [121.0, 82.0]], ('下', 0.8616531491279602)],
            [[[458.0, 25.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('上', 0.8003172874450684)],
        ]
        sortOcrResult(result)
        self.assertEqual("上下", joinResultString(result))

    def test_ocr_result_sort(self):
        result = [
            [[[440.0, 35.0], [305.0, 35.0], [305.0, 82.0], [121.0, 82.0]], ('下', 0.8616531491279602)],
            [[[450.0, 35.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('左', 0.8003172874450684)],
            [[[458.0, 35.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('右', 0.8003172874450684)],
            [[[458.0, 25.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('上', 0.8003172874450684)],
        ]
        sortOcrResult(result)
        self.assertEqual("上下左右", joinResultString(result))
    def testScanOrderResult(self):
        result = [
            [[[440.0, 35.0], [305.0, 35.0], [305.0, 82.0], [121.0, 82.0]], ('上', 0.8616531491279602)],
            [[[450.0, 35.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('下', 0.8003172874450684)],
            [[[400.0, 45.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('左', 0.8003172874450684)],
            [[[458.0, 45.0], [637.0, 35.0], [637.0, 82.0], [458.0, 82.0]], ('右', 0.8003172874450684)],
        ]
        ret = scanOrderResult(result)
        self.assertEqual([['上', '下'], ['左', '右']],ret)

if __name__ == '__main__':
    unittest.main()
